Show / Hide Table of Contents
Interface IPluginLogger
Default logging interface.
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public interface IPluginLogger
Methods
Improve this Doc   View Source
LogDebug(String, Exception)
Logs debug message.
Declaration
void LogDebug(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
Mesage to log.
 System.Exception |  ex
Optional exception to log.
Improve this Doc   View Source
LogError(String, Exception)
Logs an error message.
Declaration
void LogError(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
Message to log.
 System.Exception |  ex
Optional exception to log.
Improve this Doc   View Source
LogInformation(String, Exception)
Logs info message.
Declaration
void LogInformation(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
Mesage to log.
 System.Exception |  ex
Optional exception to log.
Improve this Doc   View Source
LogTrace(String, Exception)
Logs trace message.
Declaration
void LogTrace(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
Mesage to log.
 System.Exception |  ex
Optional exception to log.
Improve this Doc   View Source
LogWarning(String, Exception)
Logs a warning message.
Declaration
void LogWarning(string message, Exception ex = null)
Parameters
 Type |  Name |  Description
 System.String |  message
Message to log.
 System.Exception |  ex
Optional exception to log.
 Improve this Doc
 View Source